tags/religion.org
#+title: Tagged: Religion
#+setupfile: ../org-templates/post.org

- [[file:../posts/2010-02-15-the-only-alternative-to-tradition-is-bad.org][Pelikan on Tradition]]
- [[file:../posts/2010-07-25-nowhere-is-the-grace-of-god-more-evident-than-in.org][Even Preachers]]
- [[file:../posts/2010-07-26-the-things-good-lord-that-we-pray-for-give-us.org][Thomas More on Labor]]
- [[file:../posts/2010-09-17-i-believe-in-christianity-as-i-believe-that-the.org][Why Believe?]]
- [[file:../posts/2010-10-19-today-it-is-fashionable-to-talk-about-the-poor.org][Talk or Talk About]]
- [[file:../posts/2010-10-22-the-christian-literary-underground.org][The Christian Literary Underground]]
- [[file:../posts/2010-11-19-jesus-does-not-demand-great-actions-from-us-but.org][Surrender]]
- [[file:../posts/2010-12-01-the-need-for-community.org][The Need for Community]]
- [[file:../posts/2012-05-25-scheming-swindlers.org][Scheming Swindlers]]
- [[file:../posts/2015-01-20-advice-from-chesterton.org][Advice from Chesterton]]
- [[file:../posts/2015-01-20-scheming-swindlers.org][Scheming Swindlers]]
- [[file:../posts/2015-01-21-who-is-the-sparrow.org][Who is the Sparrow?]]
- [[file:../posts/2015-03-08-apostolic-living.org][Apostolic Living]]
- [[file:../posts/2015-03-09-gregory-nyssa.org][Wonder and Concepts]]
- [[file:../posts/2015-04-05-resurrection-and-hope.org][Resurrection and Hope]]
- [[file:../posts/2017-03-08-brueggemann-on-the-crisis-in-the-church.org][Brueggemann on the Crisis in the Church]]
- [[file:../posts/2017-11-20-moltmann-on-peace.org][Moltmann on Peace]]
- [[file:../posts/2010-11-03-a-life-in-prayer-is-a-life-in-open-hands-where-you.org][Perfection in Weakness]]
- [[file:../posts/2008-10-25-indifference.org][Indifference]]
- [[file:../posts/2009-06-10-seven-deadly-sins.org][Seven Deadly Sins]]
- [[file:../posts/2009-10-13-schusterman-lecture.org][Schusterman Lecture]]
- [[file:../posts/2009-10-14-burning-bibles.org][Burning Bibles?]]
- [[file:../posts/2010-02-17-al-staggs-in-chapel.org][Al Staggs in Chapel]]
- [[file:../posts/2010-02-18-the-luxury-of-cheap-melancholy.org][The Luxury of Cheap Melancholy]]
- [[file:../posts/2010-03-20-proverbs-318.org][Proverbs 31:../posts/8]]
- [[file:../posts/2010-04-18-another-great-quote-from-chaplain-school.org][Another Great Quote from Chaplain School]]
- [[file:../posts/2010-06-09-messianic-delusions.org][Messianic Delusions]]
- [[file:../posts/2010-07-15-i-cant-stand-your-religious-meetings-im-fed.org][Justice]]
- [[file:../posts/2010-07-15-there-is-in-a-word-nothing-comfortable-about-the.org][Merton on Scripture]]
- [[file:../posts/2010-09-27-if-gods-incomprehensibility-does-not-grip-us-in-a.org][Rahner]]
- [[file:../posts/2010-10-05-religious-knowledge-survey.org][Religious Knowledge Survey]]
- [[file:../posts/2010-10-25-baptist-millenials.org][Baptist Millenials]]
- [[file:../posts/2010-11-09-once-upon-a-time-the-story-goes-a-preacher-ran.org][God in Our Lives]]
- [[file:../posts/2010-11-25-to-be-alive-is-to-be-broken-to-be-broken-is-to.org][Brokenness]]
- [[file:../posts/2011-03-16-drawing-closer-to-god-through-quietness.org][Drawing Closer to God Through Quietness]]
- [[file:../posts/2011-05-13-calculating-the-end-again-and-again.org][Calculating the End — Again and Again]]
- [[file:../posts/2015-01-13-charge-to-the-church.org][Charge to the Church]]
- [[file:../posts/2015-01-13-mercy.org][Mercy, the Law, and Les Misérables]]
- [[file:../posts/2015-01-20-ordination-charge-for-brian-warfield.org][Ordination Charge for Brian Warfield]]
- [[file:../posts/2015-01-20-who-is-my-enemy.org][Who Is My Enemy?]]
- [[file:../posts/2015-02-24-father-forgive-them.org][The Cross Shattered Christ, Chapter 1]]
- [[file:../posts/2015-03-07-crucified-god-chapter-2.org][The Cross-Shattered Christ, Chapter 2]]
- [[file:../posts/2015-03-15-crucified-god-chapter-3.org][The Cross-Shattered Christ, Chapter 3]]
- [[file:../posts/2015-03-27-the-crossshattered-christ-chapter-4.org][The Cross-Shattered Christ, Chapter 4]]
- [[file:../posts/2015-03-27-the-crossshattered-christ-chapter-5.org][The Cross-Shattered Christ, Chapter 5]]
- [[file:../posts/2015-08-03-pie-in-the-sky.org][Pie in the Sky]]
- [[file:../posts/2015-08-13-go-to-your-pastor-for-depression.org][Go to Your Pastor for Depression?]]
- [[file:../posts/2015-12-09-religion-and-culture.org][Religion and Culture]]
- [[file:../posts/2016-02-11-the-ashes-of-our-idols.org][The Ashes of Our Idols]]
- [[file:../posts/2016-11-23-on-unity.org][On Christian Unity]]
- [[file:../posts/2016-12-21-christmas-communion-liturgy.org][Christmas Communion Liturgy]]
- [[file:../posts/2017-04-13-maundy-thursday.org][Thoughts on Maundy Thursday]]
- [[file:../posts/2017-06-26-making-beautiful-things.org][Making Beautiful Things]]
- [[file:../posts/2018-02-15-homily-for-ash-wednesday.org][Homily for Ash Wednesday]]
- [[file:../posts/2022-06-06-harmony-of-the-gospels.org][Harmony of the Gospels]]
- [[file:../posts/2022-10-30-reformation-sunday.org][Reformation Sunday]]
- [[file:../posts/2008-05-18-millennium-development-goals.org][Millennium Development Goals]]
- [[file:../posts/2015-07-07-guns-cakes-and-gay-weddings.org][Guns, Cakes, and Gay Weddings]]
- [[file:../posts/2016-07-31-should-the-church-bear-the-welfare-burden.org][Should the Church Bear the Welfare Burden?]]
- [[file:../posts/2009-10-23-caring-for-pets-after-the-rapture.org][Caring for Pets after the Rapture]]
- [[file:../posts/2010-02-15-tradition-and-bad-tradition.org][Tradition and Bad Tradition]]
- [[file:../posts/2015-01-13-thoughts-on-burwell-vs-hobby-lobby.org][Thoughts on Burwell vs. Hobby Lobby]]
- [[file:../posts/2010-08-11-advice-for-christian-politicians.org][Advice for Christian Politicians]]
- [[file:../posts/2010-08-16-a-mosque-in-nyc.org][A Mosque in NYC]]
- [[file:../posts/2017-03-14-usury-in-oklahoma-.org][Usury in Oklahoma]]
- [[file:../posts/2017-05-04-thoughts-on-the-johnson-amendment.org][Thoughts on Trump and the Johnson Amendment]]
- [[file:../posts/2010-12-01-on-not-understanding-prayer.org][On Not Understanding Prayer]]
- [[file:../posts/2015-05-14-prayer-for-an-isolated-people.org][Prayer for an Isolated People]]
- [[file:../posts/2015-05-24-prayer-for-memorial-day-2015.org][Prayer for Memorial Day, 2015]]
- [[file:../posts/2009-08-25-prayer-holds-together-the-shattered-fragments-of.org][Ellul on Prayer]]
- [[file:../posts/2015-07-12-courage-for-transformation.org][Courage for Transformation]]
- [[file:../posts/2015-07-12-strength-enough.org][Strength Enough?]]
- [[file:../posts/2015-01-20-penn-jillette-on-science-and-religion.org][Penn Jillette on Science and Religion]]
- [[file:../posts/2018-03-30-homily-for-maundy-thursday.org][Homily for Maundy Thursday]]

- [[file:../posts/2025-05-01-listening-those-who-left.org][Listening to Those Who Left]]
- [[file:../posts/2025-05-03-christian-right-religious-right.org][Christian Right or Religious Right?]]
- [[file:../posts/2025-07-10-christian-witness-time-war.org][Christian Witness in Time of War]]
- [[file:../posts/2025-07-10-doubt-defense.org][Doubt and Defense]]
- [[file:../posts/2025-08-17-franciscan-blessing.org][A Franciscan Blessing]]