docs/tags/religion.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- Mar 29, 2025 13:16 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Tagged: Religion</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link href='/pagefind/pagefind-ui.css' rel='stylesheet'>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/atom.xml">Feed</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<h1 class="title">Tagged: Religion</h1>
<ul class="org-ul">
<li><a href="../posts/2010-02-15-the-only-alternative-to-tradition-is-bad.html">Pelikan on Tradition</a></li>
<li><a href="../posts/2010-07-25-nowhere-is-the-grace-of-god-more-evident-than-in.html">Even Preachers</a></li>
<li><a href="../posts/2010-07-26-the-things-good-lord-that-we-pray-for-give-us.html">Thomas More on Labor</a></li>
<li><a href="../posts/2010-09-17-i-believe-in-christianity-as-i-believe-that-the.html">Why Believe?</a></li>
<li><a href="../posts/2010-10-19-today-it-is-fashionable-to-talk-about-the-poor.html">Talk or Talk About</a></li>
<li><a href="../posts/2010-10-22-the-christian-literary-underground.html">The Christian Literary Underground</a></li>
<li><a href="../posts/2010-11-19-jesus-does-not-demand-great-actions-from-us-but.html">Surrender</a></li>
<li><a href="../posts/2010-12-01-the-need-for-community.html">The Need for Community</a></li>
<li><a href="../posts/2012-05-25-scheming-swindlers.html">Scheming Swindlers</a></li>
<li><a href="../posts/2015-01-20-advice-from-chesterton.html">Advice from Chesterton</a></li>
<li><a href="../posts/2015-01-20-scheming-swindlers.html">Scheming Swindlers</a></li>
<li><a href="../posts/2015-01-21-who-is-the-sparrow.html">Who is the Sparrow?</a></li>
<li><a href="../posts/2015-03-08-apostolic-living.html">Apostolic Living</a></li>
<li><a href="../posts/2015-03-09-gregory-nyssa.html">Wonder and Concepts</a></li>
<li><a href="../posts/2015-04-05-resurrection-and-hope.html">Resurrection and Hope</a></li>
<li><a href="../posts/2017-03-08-brueggemann-on-the-crisis-in-the-church.html">Brueggemann on the Crisis in the Church</a></li>
<li><a href="../posts/2017-11-20-moltmann-on-peace.html">Moltmann on Peace</a></li>
<li><a href="../posts/2010-11-03-a-life-in-prayer-is-a-life-in-open-hands-where-you.html">Perfection in Weakness</a></li>
<li><a href="../posts/2008-10-25-indifference.html">Indifference</a></li>
<li><a href="../posts/2009-06-10-seven-deadly-sins.html">Seven Deadly Sins</a></li>
<li><a href="../posts/2009-10-13-schusterman-lecture.html">Schusterman Lecture</a></li>
<li><a href="../posts/2009-10-14-burning-bibles.html">Burning Bibles?</a></li>
<li><a href="../posts/2010-02-17-al-staggs-in-chapel.html">Al Staggs in Chapel</a></li>
<li><a href="../posts/2010-02-18-the-luxury-of-cheap-melancholy.html">The Luxury of Cheap Melancholy</a></li>
<li><a href="../posts/2010-03-20-proverbs-318.html">Proverbs 31:../posts/8</a></li>
<li><a href="../posts/2010-04-18-another-great-quote-from-chaplain-school.html">Another Great Quote from Chaplain School</a></li>
<li><a href="../posts/2010-06-09-messianic-delusions.html">Messianic Delusions</a></li>
<li><a href="../posts/2010-07-15-i-cant-stand-your-religious-meetings-im-fed.html">Justice</a></li>
<li><a href="../posts/2010-07-15-there-is-in-a-word-nothing-comfortable-about-the.html">Merton on Scripture</a></li>
<li><a href="../posts/2010-09-27-if-gods-incomprehensibility-does-not-grip-us-in-a.html">Rahner</a></li>
<li><a href="../posts/2010-10-05-religious-knowledge-survey.html">Religious Knowledge Survey</a></li>
<li><a href="../posts/2010-10-25-baptist-millenials.html">Baptist Millenials</a></li>
<li><a href="../posts/2010-11-09-once-upon-a-time-the-story-goes-a-preacher-ran.html">God in Our Lives</a></li>
<li><a href="../posts/2010-11-25-to-be-alive-is-to-be-broken-to-be-broken-is-to.html">Brokenness</a></li>
<li><a href="../posts/2011-03-16-drawing-closer-to-god-through-quietness.html">Drawing Closer to God Through Quietness</a></li>
<li><a href="../posts/2011-05-13-calculating-the-end-again-and-again.html">Calculating the End — Again and Again</a></li>
<li><a href="../posts/2015-01-13-charge-to-the-church.html">Charge to the Church</a></li>
<li><a href="../posts/2015-01-13-mercy.html">Mercy, the Law, and Les Misérables</a></li>
<li><a href="../posts/2015-01-20-ordination-charge-for-brian-warfield.html">Ordination Charge for Brian Warfield</a></li>
<li><a href="../posts/2015-01-20-who-is-my-enemy.html">Who Is My Enemy?</a></li>
<li><a href="../posts/2015-02-24-father-forgive-them.html">The Cross Shattered Christ, Chapter 1</a></li>
<li><a href="../posts/2015-03-07-crucified-god-chapter-2.html">The Cross-Shattered Christ, Chapter 2</a></li>
<li><a href="../posts/2015-03-15-crucified-god-chapter-3.html">The Cross-Shattered Christ, Chapter 3</a></li>
<li><a href="../posts/2015-03-27-the-crossshattered-christ-chapter-4.html">The Cross-Shattered Christ, Chapter 4</a></li>
<li><a href="../posts/2015-03-27-the-crossshattered-christ-chapter-5.html">The Cross-Shattered Christ, Chapter 5</a></li>
<li><a href="../posts/2015-08-03-pie-in-the-sky.html">Pie in the Sky</a></li>
<li><a href="../posts/2015-08-13-go-to-your-pastor-for-depression.html">Go to Your Pastor for Depression?</a></li>
<li><a href="../posts/2015-12-09-religion-and-culture.html">Religion and Culture</a></li>
<li><a href="../posts/2016-02-11-the-ashes-of-our-idols.html">The Ashes of Our Idols</a></li>
<li><a href="../posts/2016-11-23-on-unity.html">On Christian Unity</a></li>
<li><a href="../posts/2016-12-21-christmas-communion-liturgy.html">Christmas Communion Liturgy</a></li>
<li><a href="../posts/2017-04-13-maundy-thursday.html">Thoughts on Maundy Thursday</a></li>
<li><a href="../posts/2017-06-26-making-beautiful-things.html">Making Beautiful Things</a></li>
<li><a href="../posts/2018-02-15-homily-for-ash-wednesday.html">Homily for Ash Wednesday</a></li>
<li><a href="../posts/2022-06-06-harmony-of-the-gospels.html">Harmony of the Gospels</a></li>
<li><a href="../posts/2022-10-30-reformation-sunday.html">Reformation Sunday</a></li>
<li><a href="../posts/2008-05-18-millennium-development-goals.html">Millennium Development Goals</a></li>
<li><a href="../posts/2015-07-07-guns-cakes-and-gay-weddings.html">Guns, Cakes, and Gay Weddings</a></li>
<li><a href="../posts/2016-07-31-should-the-church-bear-the-welfare-burden.html">Should the Church Bear the Welfare Burden?</a></li>
<li><a href="../posts/2009-10-23-caring-for-pets-after-the-rapture.html">Caring for Pets after the Rapture</a></li>
<li><a href="../posts/2010-02-15-tradition-and-bad-tradition.html">Tradition and Bad Tradition</a></li>
<li><a href="../posts/2015-01-13-thoughts-on-burwell-vs-hobby-lobby.html">Thoughts on Burwell vs. Hobby Lobby</a></li>
<li><a href="../posts/2010-08-11-advice-for-christian-politicians.html">Advice for Christian Politicians</a></li>
<li><a href="../posts/2010-08-16-a-mosque-in-nyc.html">A Mosque in NYC</a></li>
<li><a href="../posts/2017-03-14-usury-in-oklahoma-.html">Usury in Oklahoma</a></li>
<li><a href="../posts/2017-05-04-thoughts-on-the-johnson-amendment.html">Thoughts on Trump and the Johnson Amendment</a></li>
<li><a href="../posts/2010-12-01-on-not-understanding-prayer.html">On Not Understanding Prayer</a></li>
<li><a href="../posts/2015-05-14-prayer-for-an-isolated-people.html">Prayer for an Isolated People</a></li>
<li><a href="../posts/2015-05-24-prayer-for-memorial-day-2015.html">Prayer for Memorial Day, 2015</a></li>
<li><a href="../posts/2009-08-25-prayer-holds-together-the-shattered-fragments-of.html">Ellul on Prayer</a></li>
<li><a href="../posts/2015-07-12-courage-for-transformation.html">Courage for Transformation</a></li>
<li><a href="../posts/2015-07-12-strength-enough.html">Strength Enough?</a></li>
<li><a href="../posts/2015-01-20-penn-jillette-on-science-and-religion.html">Penn Jillette on Science and Religion</a></li>
<li><a href="../posts/2018-03-30-homily-for-maundy-thursday.html">Homily for Maundy Thursday</a></li>
</ul>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Mar 29, 2025 13:16.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.1 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
